# 2.	Матрица. Построй M = np.arange(1, 26).reshape(5, 5). 
# Выведи: сумму главной диагонали; 
# сумму каждой строки и среднее каждого столбца; 
# центральный блок 3×3 срезом; 
# копию матрицы, где все чётные числа заменены на 0 (используй .copy() и маску M % 2 == 0; 
# исходная M не должна измениться).

import numpy as np

M = np.arange(1, 26).reshape(5,5)
m = M.copy()
print(f"сумма главной диагонали: {np.diag(M).sum()}")

print(f"сумма каждой строки: {M.sum(axis=1)}")
print (f"среднее каждого столбца: {(M.mean(axis=0)).round(2)}")

print(f"центральный блок 3×3 срезом: {M[1:4,1:4]}")

m[M % 2 == 0] = 0
print(f"копия матрицы, где все чётные числа заменены на 0:{m}")
