# 1.	Оценки. Создай массив grades = np.array([5, 3, 4, 5, 2, 4, 4, 5, 3, 4]). 
# Выведи: среднюю оценку, максимум и минимум; 
# сколько оценок не ниже 4 и какая это доля от всех; массив только из оценок ниже 4. 
# Затем посчитай стандартизованные значения (grades - mean) / std. 
# (так данные готовят для машинного обучения) и округли до двух знаков.

# Стандартизация — это пересчёт значений так, чтобы у них стало среднее 0 и «типичный разброс» 1. 
# Каждое число превращается в ответ на вопрос: «насколько этот элемент выше или ниже среднего, если мерить в единицах обычного разброса?»

import numpy as np
grades = np.array([5, 3, 4, 5, 2, 4, 4, 5, 3, 4])

print(f"средняя оценка: {grades.mean()}")
print(f"максимальная оценка: {grades.max()}") 
print (f"минимальная оценка:{grades.min()}")

print (f"сколько оценок не ниже 4: {(grades >= 4).sum()}")
print(f"какая это доля от всех оценок не ниже 4: {(grades >= 4).mean()}")

grades_less_4 = grades < 4
print(f"массив только из оценок ниже 4: {grades[grades_less_4]}")

print (f"стандартизованные значения: {((grades - grades.mean())/ grades.std()).round(2)}")
