#3.	Сумма цифр. По введённому целому числу (например, 4715) 
# посчитай сумму его цифр двумя способами: 
# через арифметику (% и // в цикле while) и через строку.

# Через while
number = abs(int(input('Введи число: '))) #модуль чтобы решение с отр.числами не упало, т.к. питон вниз и символ "-" нельзя превратить в int.
number2 = number #для того чтобы второй блок выполнялся (копия, потому что while изменяет number)
summ = 0
while number != 0:
    a=number%10
    summ = summ + a
    number = number//10
print (summ)

#Через строку
summ2 = 0
for i in str(number2):
    summ2 = summ2 + int(i)
print (summ2)
