#3.	Сортировка с lambda. Дан список people = [("Аня", 20), ("Борис", 17), ("Вера", 25), ("Глеб", 17)]. 
# Выведи: а) людей, отсортированных по возрасту по возрастанию;
# б) людей, отсортированных по длине имени по убыванию;
# в) самого старшего человека (через max).
# Во всех случаях используй key=lambda ....

people = [("Аня", 20), ("Борис", 17), ("Вера", 25), ("Глеб", 17)]
print(sorted(people, key=lambda s: s[1])) #люди, отсортированные по возрасту по возрастанию;
print(sorted(people, key=lambda s: len(s[0]), reverse=True)) #люди, отсортированные по длине имени по убыванию;
print (max(people, key = lambda s: s[1])) #самого старшего человека (через max)
