#1.	Простые числа через функцию. 
#Перепиши задачу 5 из прошлого урока. (Простые числа. Выведи все простые числа от 2 до 100)
#Напиши функцию is_prime(n), которая возвращает True или False (не печатает!). 
#Затем одним списковым включением собери список простых чисел от 2 до 100 и напечатай его. 
#Docstring у функции обязателен. Это описание функции прямо внутри её кода: короткий текст о том, что функция делает.

def is_prime(n):  
    '''Возвращает True, если n простое число, иначе False '''
    if n<2:
        return False
    for j in range (2,n):
        if n%j == 0:
            return False
    else:
        return (True)
            
primes = [n for n in range(2,101) if is_prime(n)]    #«Положи в список n, для каждого n от 2 до 100, если is_prime(n) вернула True».
print (primes)   